const faqs = [
  {
    question: "آیا محصولات شما تست کیفیت می‌شوند؟",
    answer:
      "بله، تمامی محصولات ما قبل از ارسال از نظر کیفیت بررسی و تست می‌شوند.",
  },
  {
    question: "چگونه محصولات شاردر را خریداری کنم؟",
    answer:
      "شما می‌توانید از طریق  تماس مستقیم با واحد فروش ما خرید خود را انجام دهید.",
  },
  {
    question: "شرایط گارانتی محصولات چگونه است؟",
    answer: "تمامی محصولات دارای ۵۵۵ روز وارانتی بی قید و شرط می باشند.",
  },
  {
    question: "نحوه استفاده صحیح از محصولات را از کجا یاد بگیرم؟",
    answer:
      "راهنمای استفاده در جعبه محصول قرار دارد و همچنین کاتالوگ محصولات در سایت موجود است.",
  },
  {
    question: "برای وارانتی محصولات به کجا مراجعه کنم؟",
    answer:
      "می‌توانید با خدمات پس از فروش ما تماس بگیرید تا شما را راهنمایی کنند.",
  },
  {
    question: "جنس تیغه ها از چه متریالی هستند ؟",
    answer: "تمامی تیغه های محصولات ما از جنس فولاد ضد زنگ و وارداتی هستند.",
  },
];

export default faqs;
