// Products List datas
export const products = [
  {
    id: 1,
    title: "چرخ گوشت سفید شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "سفید",
    category: "ساده",
    imgSrc: "/images/Products/product (13).webp",
    isAvaiable: true,
  },
  {
    id: 2,
    title: "چرخ گوشت مشکی شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "مشکی",
    category: "ساده",
    imgSrc: "/images/Products/product (9).webp",
    isAvaiable: true,
  },
  {
    id: 3,
    title: "چرخ گوشت نقره‌ای شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "نقره‌ای",
    category: "ساده",
    imgSrc: "/images/Products/product (1).webp",
    isAvaiable: true,
  },
  {
    id: 4,
    title: "چرخ گوشت طوسی شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "طوسی",
    category: "ساده",
    imgSrc: "/images/Products/product (11).webp",
    isAvaiable: true,
  },
  {
    id: 5,
    title: "چرخ گوشت طرح دریا شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "چند رنگ",
    category: "طرح دار",
    imgSrc: "/images/Products/product (2).webp",
    isAvaiable: true,
  },
  {
    id: 6,
    title: "چرخ گوشت سفید شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "سفید",
    category: "طرح دار",
    imgSrc: "/images/Products/product (3).webp",
    isAvaiable: true,
  },
  {
    id: 7,
    title: "چرخ گوشت قرمز شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "قرمز",
    category: "ساده",
    imgSrc: "/images/Products/product (4).webp",
    isAvaiable: true,
  },
  {
    id: 8,
    title: "چرخ گوشت طرح گل دار شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "چندرنگ",
    category: "طرح دار",
    imgSrc: "/images/Products/product (5).webp",
    isAvaiable: true,
  },
  {
    id: 9,
    title: "چرخ گوشت بژ شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "بژ",
    category: "ساده",
    imgSrc: "/images/Products/product (6).webp",
    isAvaiable: true,
  },
  {
    id: 10,
    title: "چرخ گوشت طلایی شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "طلایی",
    category: "ساده",
    imgSrc: "/images/Products/product (7).webp",
    isAvaiable: true,
  },
  {
    id: 11,
    title: "چرخ گوشت نارنجی شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "نارنجی",
    category: "ساده",
    imgSrc: "/images/Products/product (8).webp",
    isAvaiable: true,
  },
  {
    id: 12,
    title: "چرخ گوشت پلنگی شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "چند رنگ",
    category: "طرح دار",
    imgSrc: "/images/Products/product (10).webp",
    isAvaiable: true,
  },
  {
    id: 13,
    title: "چرخ گوشت سبز شاردر",
    description: [
      {
        title: "توان مصرفی: 1800 وات ",
      },
      {
        title: "مجهز به موتور گیربکسی قدرتمند",
      },
      {
        title: "جنس تیغه:اسنیل ضد زنگ",
      },
      {
        title: "دارای سری سوسیس ساز و کباب ساز ",
      },
      {
        title: "دارای محفظه نگهداری اجزاء",
      },
      {
        title: "مجهز به کلید برگشت جهت بازگرداندن گوشت ",
      },
      {
        title: " دارای محفظه نگهدارنده گوشت",
      },
      {
        title: "دارای پایه نگهدارنده سیم ",
      },
      {
        title: "دارای دو شبکه مخصوص گوشت و سبزی",
      },
      {
        title: "دارای پایه ضد لرزش و ضد لغزش",
      },
    ],
    color: "سبز",
    category: "ساده",
    imgSrc: "/images/Products/product (12).webp",
    isAvaiable: true,
  },
];

// src/lib/data/products.js

export async function getAllProducts() {
  return products;
}

export async function getProductById(id) {
  return products.find((p) => String(p.id) === String(id));
}
